Repository: TVI-ARTEM/peer-projects
Catalog: Warehouse-Client app/src/WareHouse/AppResources/ApplicationStrings.*.resx
Languages: ru_ru

# NameProductException
source: Incorrect name (only latin and cyrillic letters, digits).
ru_ru: Неправильное имя (только латинские и кирилличесике буквы, цифры).

# QuantityProductException
source: Incorrect quantity.
ru_ru: Неправильное количество товара.

# UcnProductException
source: Incorrect UCN (only latin letters, digits and "-").
ru_ru: Неправильный УНК (только латинские буквы, цифры и "-").

# CodeProductException
source: Incorrect code (only latin letters, digits and "-").
ru_ru: Неправильный код (только латинские буквы, цифры и "-").

# AdditionalSettingsText
source: Additional Settings
ru_ru: Дополнительные Настройки

# ChangeImgText
source: Change
ru_ru: Изменить

# ProductCodePlaceholder
source: Enter product code
ru_ru: Введите код товара

# ProductDescriptionPlaceholder
source: Enter description
ru_ru: Введите описание

# ProductDiscountPlaceholder
source: Enter product discount
ru_ru: Введите скидку

# GeneralSettingsText
source: General Settings
ru_ru: Основные настройки

# ProductNamePlaceholder
source: Enter product name
ru_ru: Введите имя продукта

# ProductPricePlaceholder
source: Enter product price
ru_ru: Введите цену

# ProductQuantityPlaceholder
source: Enter product quantity
ru_ru: Введите кол-во

# ProductUcnPlaceholder
source: Enter product UCN
ru_ru: Введите УНК продукта

source: Create Product
ru_ru: Создать продукт

# DiscountProductException
source: Incorrect discount (only more than 0 and less than 100).
ru_ru: Неправильная скидка (только больше 0 и меньше 100).

# NameCompanyException
source: Incorrect name (only latin and cyrillic letters and "-").
ru_ru: Неправильное имя (только латинские и кирилличесике буквы и "-").

# PriceProductException
source: Incorrect price.
ru_ru: Неверная цена

# ChiefCompanyException
source: Incorrect chief name (only latin and cyrillic letters and "-").
ru_ru: Неправильное имя главы (только латинские и кирилличесике буквы и "-").

# AdressCompanyException
source: Incorrect address (only latin and cyrillic letters, digits and "-")
ru_ru: Неправильный адресс (только латинские и кирилличесике буквы, цифры и "-").

# PhoneNumberCompanyException
source: Incorrect phone number (only digits and "-").
ru_ru: Некорректный номер (только цифры и "-").

# ImgToStringException
source: Error converting image to base64.
ru_ru: Ошибка при конвертировании изображения в base64.

# StringToImgException
source: Error converting image to base64.
ru_ru: Ошибка при конвертировании base64 в изображение.

# ErorrMessage
source: Error!
ru_ru: Ошибка!

# CompanyNamePlaceholder
source: Enter company name
ru_ru: Введите название компании

# CompanyAddressPlaceholder
source: Enter company address
ru_ru: Введите адрес компании

# CompanyPhoneNumberPlaceholder
source: Enter company phone number
ru_ru: Введите тел. номер компании

# CompanyChiefPlaceholder
source: Enter chief name
ru_ru: Введите имя главы компании

# CompanyDescriptionPlaceholder
source: Enter company description
ru_ru: Введите описание компании

# CompanyExistException
source: A company with the same name already exists.
ru_ru: Компания с таким именем уже существует.

# CompanyNotFoundException
source: A company with this name does not exist.
ru_ru: Компания с таким именем не существует.

# NameSectionException
source: Incorrect name (only latin and cyrillic letters, digits).
ru_ru: Неправильное имя (только латинские и кирилличесике буквы, цифры).

# SectionExistException
source: Section with the same name in current root already exists.
ru_ru: Раздел с таким именем в данном узле уже существует.

# SectionNotFoundException
source: A section with this name does not exist.
ru_ru: Раздел с таким именем не существует.

# ProductExistException
source: A product with the same name in current section already exists.
ru_ru: Товар с таким именем в данном узле уже существует.

# ProductNotFoundException
source: A product with this name doesn't exist.
ru_ru: Товар с таким именем не существует.

# RootNamePlaceholder
source: Enter root name
ru_ru: Введите имя узла

# SectionSelectException
source: Select one of these sections or tap cancel.
ru_ru: Выберите один из данных разделов или нажмите "Cancel".

# CompanySelectedException
source: No company selected / created.
ru_ru: Не выбрана/создана компания.

# AddRootText
source: Add root
ru_ru: Узел

# AddSectionText
source: Section
ru_ru: Подузел

# AddProductText
source: Product
ru_ru: Товар

# SearchPlaceholder
source: Enter text
ru_ru: Введите текст

# QuantityButtonText
source: Quantity
ru_ru: Кол-во

# PriceButtonText
source: Price
ru_ru: Цена

# WarningMessageText
source: Are you sure?
ru_ru: Вы уверены?

# MessageWarning
source: Warning!
ru_ru: Внимание!

# QuantityParseException
source: Quantity is not integer.
ru_ru: Количество не целое число.

# PriceParseException
source: Price is not real number.
ru_ru: Цена не действительное число.

# DiscountParseException
source: Discount is not real number.
ru_ru: Скидка не действительное число.

# ProductMinimumQuantityException
source: Incorrect quantity (more than 1).
ru_ru: Неправильное количество (больше 1).

# ProductMinimumQuantityParseException
source: Quantity is not integer.
ru_ru: Количество не целое число.

# MinimumQuantityPlaceholder
source: Enter minimum product quantity
ru_ru: Введите минимальное количество товара

# FatalErrorMessage
source: Fatal Error!
ru_ru: Критическая Ошибка!

# WarehouseExistWarning
source: Warehouse already exist. Do you want rewrite?
ru_ru: Склад уже существует. Вы хотите перезаписать?

# LoadWarningMessage
source: Save data before upload
ru_ru: Перед загрузкой сохраните данные

# ClientLoginNameException
source: Incorrect username.
ru_ru: Некорректное имя пользователя

# ClientEmailException
source: Incorrect user e-mail.
ru_ru: Некорректные e-mail пользователя.

# ClientPasswordException
source: Incorrect password (minimum three characters, at least one letter, one number)
ru_ru: Некорректный пароль (как минимум 3 символа, одна буква, одна цифра).

# ClientFirstNameException
source: Incorrect first name.
ru_ru: Некорректное имя.

# ClientLastNameException
source: Incorrect last name.
ru_ru: Некорректная фамилия.

# ClientPatronymicException
source: Incorrect patronymic.
ru_ru: Некорректное отчество.

# ClienPhoneNumberException
source: Incorrect phone number.
ru_ru: Некорректный номер телефона.

# ClientExistException
source: Client with the same login or e-mail already exists.
ru_ru: Пользователь с таким же логином или e-mail уже существует.

# ClientGetException
source: Incorrect login or password.
ru_ru: Некорректный логин или пароль.

# LoginTypeUser
source: User
ru_ru: Пользователь

# LoginTypeWorker
source: Worker
ru_ru: Рабочий

# CityMoscow
source: Moscow
ru_ru: Москва

# CitySaintPeter
source: Saint-Petersburg
ru_ru: Санкт-Петербург

# CityNovosibirsk
source: Novosibirsk
ru_ru: Новосибирск

# CityYekaterinburg
source: Yekaterinburg
ru_ru: Екатеринбург

# CityKazan
source: Kazan
ru_ru: Казань

# CityNizhnyNovgorod
source: Nizhny Novgorod
ru_ru: Нижний Новгород

# CityChelyabinsk
source: Chelyabinsk
ru_ru: Челябинск

# CityOmsk
source: Omsk
ru_ru: Омск

# CitySamara
source: Samara
ru_ru: Самара

# CityRostovOnDon
source: Rostov-on-Don
ru_ru: Ростов-на-Дону

# CityUfa
source: Ufa
ru_ru: Уфа

# CityKrasnoyarsk
source: Krasnoyarsk
ru_ru: Красноярск

# CityPermian
source: Permian
ru_ru: Пермь

# CityVoronezh
source: Voronezh
ru_ru: Воронеж

# CityVolgograd
source: Volgograd
ru_ru: Волгоград

# CityIdException
source: Incorrect city ID.
ru_ru: Некорректный ID города.

# ProductControlTitle
source: Title: {0}
ru_ru: Название: {0}

# ProductControlPrice
source: Price: {0} {1}
ru_ru: Цена: {0} {1}

# ProductControlMore
source: More
ru_ru: Больше

# LogoLabel
source: Shop
ru_ru: Магазин

# ProductTitleText
source: Title: {0}
ru_ru: Название: {0}

# ProductPriceText
source: Price: {0} {1}
ru_ru: Цена: {0} {1}

# ProductCompanyText
source: Company: {0}
ru_ru: Компания: {0}

# ProductDiscountText
source: Discount: {0} %
ru_ru: Скидка: {0} %

# ProductCountryText
source: Country: {0}
ru_ru: Страна: {0}

# ProductGuaranteeText
source: Guarantee: {0}
ru_ru: Гарантия: {0}

# ProductDescriptionText
source: Description:
ru_ru: Описание:

# OrderQuantityText
source: Quantity:
ru_ru: Количество:

# LoginLabelText
source: LOGIN
ru_ru: ВХОД

# LoginButtonText
source: Login
ru_ru: Вход

# ForgotPasswordThinButtonText
source: Forgot Password?
ru_ru: Забыли Пароль?

# SignUpThinButtonText
source: Sign Up
ru_ru: Зарегистрироваться

# PasswordTextBoxTextPlaceholder
source: Password
ru_ru: Пароль

# FirstNameTextBoxTextPlaceholder
source: Name
ru_ru: Имя

# PatronymicTextBoxTextPlaceholder
source: Patronymic
ru_ru: Отчество

# LastNameTextBoxTextPlaceholder
source: Last Name
ru_ru: Фамилия

# PhoneNumberTextBoxTextPlaceholder
source: Phone Number
ru_ru: Номер Телефона

# BuyButtonText
source: To Cart
ru_ru: В Корзину

# TotalPayableLabelText
source: Total payable: {0} {1}
ru_ru: Итого к оплате: {0} {1}

# OrderQuantityException
source: Incorrect order quantity (more than 0).
ru_ru: Некорректное количество заказа (больше 0).

# OrderFormedException
source: Order is not formed.
ru_ru: Заказ не сформирован.

# OrderPaidUpException
source: Order is not paid up.
ru_ru: Заказ не оплачен.

# OrderShippedException
source: Order is not shipped.
ru_ru: Заказ не отгружен.

# OrderProcessedException
source: Order is not processed.
ru_ru: Заказ не обработан.

# ChangeButtonText_Shape
source: Shape
ru_ru: Сформировать

# ChangeButtonText_Process
source: Process
ru_ru: Обработать

# ChangeButtonText_Pay
source: Pay
ru_ru: Оплатить

# ChangeButtonText_Ship
source: Ship
ru_ru: Отгрузить

# ChangeButtonText_Paid_up
source: Paid up
ru_ru: Оплачено

# ChangeButtonText_Execute
source: Execute
ru_ru: Исполнить

# ChangeButtonText_Completed
source: Completed
ru_ru: Исполнен

# PriceMinimumException
source: Incorrect minimum price.
ru_ru: Некорректная минимальная цена.

# ShowOrdersButtonText
source: Show Orders
ru_ru: Показать Заказы

# OrderManageFormLogoLabelText
source: Orders
ru_ru: Заказы

# ClientsButtonText
source: Clients
ru_ru: Клиенты

# OrdersButtonText
source: Orders
ru_ru: Заказы

# ActiveLabelText
source: Show Active Orders:
ru_ru: Показать Активные Заказы:

# ReportText
source: Report
ru_ru: Отчет

# AddRootButtonToolTip
source: Add Root
ru_ru: Добавить Узел

# AddRootButtonToolTipTitle
source: Root
ru_ru: Узел

# AddSectionButtonToolTip
source: Add Section
ru_ru: Добавить Раздел

# AddSectionButtonToolTipTitle
source: Section
ru_ru: Раздел

# AddProductButtonToolTip
source: Add Product
ru_ru: Добавить Товар

# AddProductButtonToolTipTitle
source: Product
ru_ru: Товар

# ExportCsvButtonToolTip
source: Create CSV Report
ru_ru: Создать CSV Отчет

# ExportCsvButtonToolTipTitle
source: Report
ru_ru: Отчет

# GenerateButtonToolTip
source: Generate Roots, Sections And Products
ru_ru: Сгенирировать Узлы, Разделы и Товары

# GenerateButtonToolTipTitle
source: Generate
ru_ru: Создать

# QuantityButtonToolTip
source: Order sections by product quantity
ru_ru: Отсортировать разделы по количеству товаров

# QuantityButtonToolTipTitle
source: Quantity Order
ru_ru: Сортировать по количеству

# PriceButtonToolTip
source: Order section by product price
ru_ru: Отсортировать секции по цене товаров

# PriceButtonToolTipTitle
source: Price Order
ru_ru: Сортировать по цене товаров

# EngButtonToolTip
source: Change Language Into English
ru_ru: Изменить Язык На Английский

# EngButtonToolTipTitle
source: English
ru_ru: Английский

# RusButtonToolTip
source: Change Language Into Russian
ru_ru: Изменить Языка На Русский

# RusButtonToolTipTitle
source: Russian
ru_ru: Русский

# SearchTextBoxToolTip
source: Filter products
ru_ru: Отфильтровать продукты

# SearchTextBoxToolTipTitle
source: Filter
ru_ru: Фильтр

# ShowOrdersButtonToolTip
source: Show Client's Orders
ru_ru: Показать Заказы Клиентов

# ShowOrdersButtonToolTipTitle
source: Orders
ru_ru: Заказы

# ChangeAccBoxToolTip
source: Change Account
ru_ru: Сменить Аккаунт

# ChangeAccBoxToolTipTitle
source: Account
ru_ru: Аккаунт

# BasketBoxToolTip
source: Open basket cart
ru_ru: Открыть корзину товаров

# BasketBoxToolTipTitle
source: Basket cart
ru_ru: Корзина товаров

# UserNameTextBoxToolTip
source: Your login
ru_ru: Ваш логин

# UserNameTextBoxToolTipTitle
source: Login
ru_ru: Логин

# ProductTitleTextBoxToolTip
source: Product title
ru_ru: Название продукта

# ProductTitleTextBoxToolTipTitle
source: Title
ru_ru: Название

# ProductPriceTextBoxToolTip
source: Product price
ru_ru: Цена продукта

# ProductPriceTextBoxToolTipTitle
source: Price
ru_ru: Цена

# ProductCompanyTextBoxToolTip
source: Product company
ru_ru: Производитель товара

# ProductCompanyTextBoxToolTipTitle
source: Company
ru_ru: Производитель

# ProductDiscountTextBoxToolTip
source: Product discount
ru_ru: Скидка на товар

# ProductDiscountTextBoxToolTipTitle
source: Discount
ru_ru: Скидка

# ProductCountryTextBoxToolTip
source: Product country
ru_ru: Страна производителя товара

# ProductCountryTextBoxToolTipTitle
source: Country
ru_ru: Страна

# ProductGuaranteeTextBoxToolTip
source: Product guarantee
ru_ru: Гарантия на товар

# ProductGuaranteeTextBoxToolTipTitle
source: Guarantee
ru_ru: Гарантия

# BuyButtonToolTip
source: Add to cart
ru_ru: Добавить в корзину

# BuyButtonToolTipTitle
source: Cart
ru_ru: Корзина

# ProductQuantityTextBoxToolTip
source: Product quantity
ru_ru: Количество товара

# ProductQuantityTextBoxToolTipTitle
source: Quantity
ru_ru: Количество

# CreateReportButtonToolTip
source: Create report
ru_ru: Создать отчет

# CreateReportButtonToolTipTitle
source: Title
ru_ru: Отчет

# OrderIDTextBoxToolTip
source: Order unique ID
ru_ru: Уникальное ID заказа

# OrderStatusTextBoxToolTip
source: Current order status
ru_ru: Текущий статус заказа

# OrderStatusTextBoxToolTipTitle
source: Status
ru_ru: Статус

# OrderTimeTextBoxToolTip
source: Order creation time
ru_ru: Время формирования заказа

# OrderTimeTextBoxToolTipTitle
source: Time creation
ru_ru: Время создания

# MoreButtonToolTip
source: Get more info
ru_ru: Получить больше информации

# MoreButtonToolTipTitle
source: Info
ru_ru: Информация

# OrdersButtonToolTip
source: Show user orders
ru_ru: Показать заказы клиента

# OrdersButtonToolTipTitle
source: Orders
ru_ru: Заказы

# ClientOrdersQuantityTextBoxToolTip
source: Client's orders quantity
ru_ru: Количество заказов клиента

# ClientOrdersQuantityTextBoxToolTipTitle
source: Orders quantity
ru_ru: Количество товаров

# UserButtonToolTip
source: Click this if you are user
ru_ru: Нажмите это, если вы клиент

# UserButtonToolTipTitle
source: User
ru_ru: Клиент

# WorkerButtonToolTip
source: Click this if you are worker
ru_ru: Нажмите это, если вы рабочий

# WorkerButtonToolTipTitle
source: Worker
ru_ru: Рабочий

# ApplicationRunnigException
source: There is already an instance running
ru_ru: Приложение уже запущено
